#include<iostream>
void main() {
	using namespace std;
	setlocale(LC_ALL, "rus");
	double c_1, c_2;
	cout << "Кол-во воды в первом сосуде ";
	cin >> c_1;
	cout << "Кол-во воды во втором сосуде ";
	cin >> c_2;
	for (int n = 1; n <= 4; n++)
	{
		c_1 /= 2;
		c_2 += c_1;
		c_2 /= 2;
		c_1 += c_2;
	}
	cout << "В первом сосуде " << c_1 << " литров" << endl;
	cout << "Во втором сосуде " << c_2 << " литров" << endl;
}
/*
17 7
1)
8.5 15.5
16.25 7.75
2) 
8.125 15.875
16.0625 7.9375
3)
8.03125 15.96875
16.015625  7.984375
4)
8.0078125 15.9921875
 16.0039363 7.99609375
*/